'''
    day03复习:
    语句:
       -- 选择语句
          if 条件:
             满足条件1执行的语句
          else 条件2:
             满足条件2执行的语句
          else:
             以上条件都不满足时执行的语句
       -- 循环语句
          while 条件:
             满足条件重复执行的代码
          else:
             不满足条件执行的代码
             break语句退出的不执行

          for 变量 in 可迭代对象：
             ...
          else:
             ...

          适用性:while循环适合根据条件反复执行,不知次数
                for循环适合预定次数的循环

       -- 跳转语句
          break        跳出循环
          continue     跳过本次,进行下次循环
'''